In [1]:
import pandas as pd
city_pop_file = "https://milliams.com/courses/data_analysis_python/city_pop.csv"
pd.read_csv(city_pop_file)

                          This is an example CSV file
0   The text at the top here is not part of the da...
1   to describe the file. You'll see this quite of...
2                     A -1 signifies a missing value.
3                              year;London;Paris;Rome
4                              2001;7.322;2.148;2.547
5                                   2006;7.652;;2.627
6                                      2008;-1;2.211;
7                                 2009;-1;2.234;2.734
8                                        2011;8.174;;
9                                 2012;-1;2.244;2.627
10                                       2015;8.615;;

In [2]:
pd.read_csv(city_pop_file,skiprows=5).head(2)

   year;London;Paris;Rome
0  2001;7.322;2.148;2.547
1       2006;7.652;;2.627

In [3]:
pd.read_csv(city_pop_file,skiprows=5,sep=";").head(2)

   year  London  Paris   Rome
0  2001   7.322  2.148  2.547
1  2006   7.652    NaN  2.627

In [4]:
pd.read_csv(city_pop_file,skiprows=5,sep=";",na_values="-1").head(2)

   year  London  Paris   Rome
0  2001   7.322  2.148  2.547
1  2006   7.652    NaN  2.627

In [5]:
pd.read_csv(city_pop_file,skiprows=5,sep=";",na_values="-1",index_col="year").head(2)

      London  Paris   Rome
year
2001   7.322  2.148  2.547
2006   7.652    NaN  2.627